In [21]:
import pandas as pd
df17 = pd.read_csv('http://blockchainainyc.com/wp-content/uploads/2018/06/pandas17june.csv')
df17

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
1    B    B   34  231231      F        14
2    C    Q   54  321321      F        32
3    D    M   43   32131      M        21

In [25]:
df17[df17['City']=='M']

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
3    D    M   43   32131      M        21

In [39]:
df17[(df17['City']=='M') & (df17['Age']>35)]

  Name City  Age  Salary Gender  Distance
3    D    M   43   32131      M        21

0    False
1    False
2     True
3     True
Name: Age, dtype: bool

In [31]:
df17[df17['City']=="M"]

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
3    D    M   43   32131      M        21

In [7]:
df17.dtypes

Name        object
City        object
Age          int64
Salary       int64
Gender      object
Distance     int64
dtype: object

In [40]:
df17[(df17['Gender']=='M') & (df17['Age']>35)]

  Name City  Age  Salary Gender  Distance
3    D    M   43   32131      M        21

In [45]:
df17.groupby(['City'])['City'].count()

City
B    1
M    2
Q    1
Name: City, dtype: int64

In [46]:
df17

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
1    B    B   34  231231      F        14
2    C    Q   54  321321      F        32
3    D    M   43   32131      M        21

In [52]:
df17.iloc[1:,:]

  Name City  Age  Salary Gender  Distance
1    B    B   34  231231      F        14
2    C    Q   54  321321      F        32
3    D    M   43   32131      M        21

In [53]:
df17

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
1    B    B   34  231231      F        14
2    C    Q   54  321321      F        32
3    D    M   43   32131      M        21

In [55]:
df17.iloc[:2,1:2]

  City
0    M
1    B

In [57]:
df19 = pd.read_csv('http://blockchainainyc.com/wp-content/uploads/2018/06/newdata.csv')
df19

  Name City  Age  Salary Gender  Distance
0    E    M   43   12312      M        54
1    F    B   43  231231      F        32
2    G    Q   43  321321      F        32
3    H    C   43   32131      M        32

In [59]:
pd.concat([df17,df19])

  Name City  Age  Salary Gender  Distance
0    A    M   32   12312      M        10
1    B    B   34  231231      F        14
2    C    Q   54  321321      F        32
3    D    M   43   32131      M        21
0    E    M   43   12312      M        54
1    F    B   43  231231      F        32
2    G    Q   43  321321      F        32
3    H    C   43   32131      M        32